import { Locator, Page, test } from "@playwright/test";
class Car {
  brand: string;
  color: string;
  constructor(brand: string, color: string) {
    this.brand = brand;
    this.color = color;
  }

  drive(where) {
    console.log(
      `Car brand ${this.brand} with ${this.color} color was going to ${where}`
    );
  }
}

const polestarCar = {
  brand: "polestar",
  color: "black",
};

const AudiCar = {
  brand: "audi",
  color: "white",
};

// екземплятор класса
const newCar = new Car("Mazda", "red");
console.log(newCar);
newCar.drive("New-York");

class somePage {
  static click() {
    throw new Error("Method not implemented.");
  }
  page: string;
  constructor() {
    this.page = this.page;
  }

  click() {
    // this.page.locator().click();
  }
}

// const example = new somePage("page");
somePage.click();

test("test some page", ({ page }) => {
  // const somePage = new somePage(page);
});

// інкапсуляція
// якщо ми звернемося до обьекта somePage
// ми перевантаєуʼмо інформаціʼю яінтерфейс кінцевому користувачу
// і якщо ми хочемо спростити сприйнятя та полегшити взаємодію з своїм классном а як сховати непорібні методи і непотрібні властивості від кінцевого юзера
// це як повівнювати лінукс і мак ос
// лінукс дає майже нескінченні властивості та конфігурації вивалюючи на кінцевого юзера всі свої інтерфейли і увже взвємодій з ними як хочешь
// мак ос більш закрити система вона дає лише необхідніше кінцевому користувачу при цьому процес аутбордингу робить більш гладким меньше ламається коли на тебе вивалюють кучу інтерфейсів то взаємодіяти з ними стає важко
// Так і в программуванні коли ви проектуєте клас завжди думайте про те а як ім будут користуватися кінцеві користувачі а яку інфу ви хочете надати кінцевому користувачу
// вони повиині спроєкнувати свій класс таким чином шоб взаємодія була набагато легче і було як омога менше питань то принцип
// ви повинні спроєктувати класс шоб взаємодія була легкой

// Тому принцип ООП інкапсуляції каже нам про те шоб ви завжди приховували деталі реалізації і доспути через методи які надає мова программуванні
// треба завжди старатися приховати мову реалізації непотрібну для кінцевого користувача методів або властивостей
// і для цього в тс є 3 ключових слова якіми ми можемо реалізувати інкапсуляцію - private  public read only
// private - робить властивість доступною лише всередині классу і в екземплярі класса достукатися до цієї властивості вже не можливо ми іії не можемо отримати в обьекте вона не видима
// є хорошою практикою при побудові пейджобжекта поля по типу пейдж або локатори інколи локатори теж потрібно ховати від кінцевого користувача за допомогою модифікатора private
// public - будь яка властивість або метод є публічним public і доступний для взвємодією
// Він рекомендує на початку завжди писати модифікатори доступу Навіть якщо шо по дефолту властивість є публічною я рекомендую всеріно писати вам це подоможе краще запомятовувати модефикатори доступу
// Чим більше будете писати тим лекше буде запамятовувати
// Protected ( модефикатори доступу ) - він  як і private не доступний але він буде доступний якщо ми будемо використовувати наслідування

// наслідування - це принцип ООП який дозволяє створювати нові класси на основі уже існуючих класів
// Нові класси успадковують властивості і методи батьковського классу і цей принип можливість надає нам великий простір шоб не дублювати код
// word Base шось базове використовується для наслідування з цієї пейджу наслідуються інщі пейджі тому шо вона базова вона має основні властивості основні методи які будуть доступні для цих пейджів

class basePage {
  private page: Page;
  public someElementXPath: string = "//#";
  protected someElementXPath2: string = "//#";
  constructor() {
    this.page = this.page;
  }

  click() {
    // this.page.locator().click();
  }
  navigate(url: string) {
    this.page.goto("");
  }
}

//  in ts we have key word extends и сюди потрібно передати назву клвссу який ви хочете наслідувати
class LoginPage extends basePage {
  readonly someElementLocator: Locator = this.page.locator("test");
  construstor(page: Page) {
    super(page);
  }
  clickOnLoginPage() {
    this.page.locator("").click();
    console.log(this.someElementXPath2);
  }
}

const login = new LoginPage();

// коли у вас є 2-3 класи які унаслідовали один одного не потрібно пердавати всюди
//  пейджу вам просто поті в базовий клас передати і з нього просто будете використовувати його
//  так як кожен наслідувач классу буде мати доступ до необхідних властивостей
//  користувватися private приватними методами и властивостями я можу користуватися лише в середині классу

//  але до протектед Protected можно дістатися через  class LoginPage extends basePage {

//  }
//  40 мин

test("some test", async ({ page }) => {
  const loginPage = new LoginPage();
  loginPage.clickOnLoginPage();
});

//  коли ви наслідуєтьсь і потім робити обьект думайте про це я к про мердж двух обьектов
//   наприклад у нас LoginPage и basePage мерджаться в 1 обьект и я який має всі обьекти родителя
//   і свої властивості і методи
//   ми можете наслідуватися скільки угодно
